УТ_для_edt/src/Catalogs/смартКонструкторОборудования/смартКонструкторОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартКонструкторОборудования</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ОсновнаяКонфигурация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматПринтера</name>
    <type>
      <types>CatalogRef.смартФорматыПринтеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехнологияПечати</name>
    <type>
      <types>CatalogRef.смартТехнологииПечати</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаПечати</name>
    <type>
      <types>CatalogRef.смартШиринаПечати</types>
    </type>
  </attributes>
  <attributes>
    <name>Бренд</name>
    <type>
      <types>CatalogRef.Марки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОборудования</name>
    <type>
      <types>CatalogRef.смартВидыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатающаяГоловка</name>
    <type>
      <types>CatalogRef.смартПечатающиеГоловки</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтраницаНаСайте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.смартКонструкторОборудованияПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Инфо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинкиПечатающейГоловки</name>
    <type>
      <types>CatalogRef.смартКонструкторОборудованияПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Скидка</name>
    <comment>//++ #Б-3094 смарт: Фролов 16.04.2025 //Доработка справочника Конструктор оборудования.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наценка</name>
    <comment>//++ #Б-3094 смарт: Фролов 16.04.2025 //Доработка справочника Конструктор оборудования.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <comment>//++ #Б-3094 смарт: Фролов 16.04.2025 //Доработка справочника Конструктор оборудования.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеАкции</name>
    <comment>//++ #Б-3094 смарт: Фролов 16.04.2025 //Доработка справочника Конструктор оборудования.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <comment>//++ #Б-3094 смарт: Фролов 16.04.2025 //Доработка справочника Конструктор оборудования.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГарантияНаПечатающиеГоловки</name>
    <comment>//++ #Б-3154 смарт: Фролов 22.04.2025 //Доработки НСИ Конструктора КП.</comment>
    <type>
      <types>CatalogRef.смартГарантийныеСрокиНаОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>ГарантияНаОборудование</name>
    <comment>//++ #Б-3154 смарт: Фролов 22.04.2025 //Доработки НСИ Конструктора КП.</comment>
    <type>
      <types>CatalogRef.смартГарантийныеСрокиНаОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеКаретки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗамечанияПоКаретке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаАкции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияАкции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокАкции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Конструктор</name>
    <comment>//++ #Б-3502 смарт: Фролов 06.06.2025 //Доработка НСИ Конструктора КП</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновныеФишки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Применения</name>
    <attributes>
      <name>Применяется</name>
      <type>
        <types>CatalogRef.смартПроизводимаяПродукция</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеОпции</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.смартКонструкторОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресСсылки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Обязательна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>//++ #Б-6536 смарт: Фролов 17.04.2026 //Доработки объектов Конструктора КП.</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВключатьВЦенуОсновногоТовара</name>
      <comment>//++ #Б-6536 смарт: Фролов 17.04.2026 //Доработки объектов Конструктора КП.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СопутствующиеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.смартКонструкторОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресСсылки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Обязательна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолезныеМатериалы</name>
    <attributes>
      <name>ВидМатериала</name>
      <type>
        <types>CatalogRef.смартПолезнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресСсылки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦветовыеСхемы</name>
    <attributes>
      <name>ЦветоваяСхема</name>
      <type>
        <types>CatalogRef.смартЦветовыеКонфигурации</types>
      </type>
    </attributes>
    <attributes>
      <name>ВозможенГлянец</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ГлянецОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГлянецДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БезГлянцаОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БезГлянцаДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПечатающиеГоловки</name>
    <attributes>
      <name>ПечатающаяГоловка</name>
      <type>
        <types>CatalogRef.смартПечатающиеГоловки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.смартВидыМатериалов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Гарантия</name>
    <comment>//++ #Б-3094 смарт: Фролов 21.04.2025 //Доработка справочника Конструктор оборудования.</comment>
    <attributes>
      <name>Строка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВключеноВСтоимость</name>
    <comment>//++ #Б-3094 смарт: Фролов 21.04.2025 //Доработка справочника Конструктор оборудования.</comment>
    <attributes>
      <name>Строка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НашиПреимущества</name>
    <comment>//++ #Б-3094 смарт: Фролов 21.04.2025 //Доработка справочника Конструктор оборудования.</comment>
    <attributes>
      <name>Строка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехническиеХарактеристики</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СмартФильтрыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.СмартФильтрыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РекомендуемыеЧернила</name>
    <attributes>
      <name>Чернила</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.СмартДопФильтрыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ПечатающаяГоловка</name>
      <comment>//++ #Б-4310 смарт: Фролов 10.09.2025 //Доработки Конструктора КП.</comment>
      <type>
        <types>CatalogRef.смартПечатающиеГоловки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Шаблоны</name>
    <attributes>
      <name>Шаблон</name>
      <type>
        <types>CatalogRef.смартШаблоныДанныхКонструктора</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Аналоги</name>
    <comment>//++ #Б-4770 смарт: Фролов 20.10.2025 //Доработка справочника Конструктор оборудования.</comment>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Чернила</name>
    <comment>//++ #Б-5656 смарт: Фролов 09.02.2026 //Доработка справочников для проекта DEERAY</comment>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/смартКонструкторОборудования/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазы(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоГруппа Тогда
		
		Если НЕ ЗначениеЗаполнено(ДатаСоздания) Тогда
			ДатаСоздания = ТекущаяДата();
		КонецЕсли;
		
		МассивНаименованийГоловок = Новый Массив;
		Для каждого стрГоловка Из ПечатающиеГоловки Цикл
			Если ЗначениеЗаполнено(стрГоловка.ПечатающаяГоловка.НаименованиеСокращенное) Тогда
				МассивНаименованийГоловок.Добавить(стрГоловка.ПечатающаяГоловка.НаименованиеСокращенное);
			КонецЕсли;
		КонецЦикла;
		
		Инфо = СтрСоединить(МассивНаименованийГоловок, ", ");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
